function Parent = Roullette(Population,Fitness);
% הפונקציה הזו בוחרת 2 הורים מתוך האוכלוסיה.
% ככל שהפיטנס של ההורה גדול יותר, יש לו יותר סיכוי להיבחר.
% לדוגמא, אם היו רק שני הורים באוכלוסיה ואחד קיבל פיטנס של 8 והשני של 4,
% הסיכוי של הראשון להיבחר הוא 66% ושל השני - 33%.

% שלב ראשון
% לחשב את האחוז של הפיטנס של כל פרט.
% השתמשו בפקודה sum המסכמת את ערך וקטור הפיטנס.
% אין צורך בלולאה.

% YOUR CODE
SumF=sum(Fitness);
ParentPercent=(Fitness(1:length(Fitness))/SumF);

% שלב שני - הגדירו את 'גלגל הרולטה' - באמצעות הפקודה cumsum צרו וקטור שבו
% כל ערך הוא סכום כל הערכים עד אליו.
% לדוגמא, עבור הוקטור [1 5 3] הפונקציה תוציא [9 8 3]
% בצורה כזו, המרווח בין כל זוג יהיה האחוז של הפרט הגבוה מבין הזוג
% באוכלוסיה.

% YOUR CODE
CSParent=cumsum(ParentPercent);

%שלב שלישי - 
% בשלב הזה ביחרו רנדומלית את אחד הפרטים
% הגרילו מספר רנדומלי בין 0 ל1-.

% YOUR CODE
rnd1=rand();

% שלב רביעי - 
% לאחר מכן עיברו באמצעות לולאת for על כל הגלגל, ובידקו האם המספר הרנדומלי
% שלכם קטן מהערך של האיבר בוקטור שיצרתם בשלב הקודם.
% הבדיקה תבוצע באמצעות if.
% אם הוא קטן ממנו - זה אומר שהוא נמצא במרווח שמוגדר ע"י האיבר המסוים הזה,
% ולכן כעת עליכם לבחור את ההורה בעל אותו אינדקס מתוך האוכלוסיה.
% לאחר הבחירה אין צורך להמשיך לעבור על כל האינדקסים הנוספים. תוכלו לצאת
% מהלולאה באמצעות הפקודה break, היוצאת מלולאות for.

% YOUR CODE

for j=1:length(CSParent)
    if(rnd1<=CSParent(j))
        p=j;
        break
    end
end
Parent=Population(:,p);

        