function Mutated = AddMutations(Original,Pm);
% הפונקציה הזו מקבלת וקטור עמודה שהוא פרט באוכלוסיה, ומוסיפה לו מוטציות,
% כלומר, בהסתברות Pm עבור כל ביט היא הופכת אותו מ0- ל1- או מ1- ל0-.

% איך עושים זאת?
% שלב ראשון - 
% נגריל וקטור בגודל של הוקטור המקודי שלנו (Original) עם מספרים אקראיים בין
% 0 ל1-. לשם כך השתמשו בפונקציות rand ו-size 
% הפונקציה rand יוצרת מספרים אקראיים בין 0 ל1- במימדים שאותם אנחנו נותנים
% לה. הפונקציה size מוצאת את המימדים של וקטור או מטריצה קיימים - היא מוציאה
% וקטור עם מספר השורות ומספר העמודות.

% YOUR CODE
Ran=rand(size(Original,1),1);

% שלב שני - 
% כעת יש להוסיף את המוטציות - בחרו את המקומות בהם הוקטור הרנדומלי היה קטן
% מהסתברות המוטציה, ובאינדקסים הללו היפכו אחד ל0- ו0- ל1- ע"י הפונקציה not.

% YOUR CODE
Mutated=zeros(size(Original,1),1);
for k=1:size(Original,1)
   if(Ran(k)<Pm/100)
      Mutated(k,1)=not(Original(k,1));
   else
      Mutated(k,1)=Original(k,1);
   end
end