function [Offspring1 ,Offspring2] = CrossOver(Parent1,Parent2,Pc);
% הפונקציה הזו  לוקחת שני הורים, כל אחד מהם הוא וקטור עמודה.
% בהסתברות Pc היא מבצעת ביניהם קרוסאובר, כלומר, לוקחת חתיכה מוקטור אחד, עד
% אינדקס מסוים, ומחברת לה חתיכה מהוקטור השני, מאותו אינדקס והלאה.

% לדוגמא - אם יש שני הורים, אחד הוא [1 1 1 1] והשני הוא [0 0 0 0], ונבחר
% שנעשה קרוס אובר לאחר הספרה הראשונה, יתקבלו שני צאצאים: [0 0 0 1] ו-[1 1 1
% 0]

% שלב ראשון - נבדוק האם לבצע קרוס אובר (קרוס אובר מבוצע רק בהסתברות Pc)
% נגריל מספר רנדומלי בין 0 ל1- באמצעות הפקודה rand.
% אם המספר קטן מ-Pc נבצע בשלבים הבאים את הקרוס אובר, אם לא - לא נבצע, ואז
% הצאצאים זהים להורים.
% (השתמשו ב-if)

% YOUR CODE
nrows=size(Parent1,1);
r=rand();
if(r<(Pc/100))
    

% שלב שני - בתוך ה-if, במקרה של  ביצוע הקרוס אובר - נבחר את האינדקס שעד
% אליו לוקחים מהורה אחד וממנו לוקחים מההורה השני בשביל ליצור צאצא אחד,
% וההפך בשביל ליצור את הצאצא השני.
% בחירת האינדקס תעשה ע"י הפקודה randperm, אשר מחזירה וקטור של מספרים שלמים
% עד ערך מסוים, בסדר אקראי.
% למשל - randperm(3) יכול לתת [3 1 2]
% נבחר את הערך הראשון בוקטור להיות האינדקס שלנו.

% YOUR CODE
Is=randi(nrows);
Offspring1(1:nrows,1)=[Parent1(1:(Is-1),1); Parent2(Is:end,1)];
Offspring2(1:nrows,1)=[Parent2(1:(Is-1),1); Parent1(Is:end,1)];
else
% שלב שלישי - בתוך ה-if, אם לא מבצעים קרוסאובר אז מגדירים שהצאצאים זהים
% להורים.

% YOUR CODE
Offspring1=Parent1;
Offspring2=Parent2;

end